data/load-test-api.txt
==> POST /bids  concurrency=2  60s
hey -c 2 -z 60s -m POST \
                -H "X-Customer-ID: as12345" \
                -H "Content-Type: application/json" \
                -d '{"ingress_port":1,"egress_port":0,"units":50,"unit_price":60}' \
                http://146.190.195.42/bids

Summary:
  Total:        60.0594 secs
  Slowest:      0.1583 secs
  Fastest:      0.0175 secs
  Average:      0.0354 secs
  Requests/sec: 56.4608

  Total data:   40692 bytes
  Size/request: 12 bytes

Response time histogram:
  0.018 [1]     |
  0.032 [1822]  |########################################
  0.046 [947]   |#####################
  0.060 [356]   |########
  0.074 [140]   |###
  0.088 [73]    |##
  0.102 [34]    |#
  0.116 [15]    |
  0.130 [2]     |
  0.144 [0]     |
  0.158 [1]     |

Latency distribution:
  10% in 0.0223 secs
  25% in 0.0252 secs
  50% in 0.0304 secs
  75% in 0.0403 secs
  90% in 0.0553 secs
  95% in 0.0683 secs
  99% in 0.0925 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0000 secs, 0.0197 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0023 secs
  resp wait:    0.0352 secs, 0.0174 secs, 0.1581 secs
  resp read:    0.0001 secs, 0.0000 secs, 0.0089 secs

Status code distribution:
  [202] 3391 responses


==> GET /flows  concurrency=2  60s
hey -c 2 -z 60s \
                -H "X-Customer-ID: as12345" \
                "http://146.190.195.42/flows?switch_id=sw-1&ingress_port=1&egress_port=0"

Summary:
  Total:        60.0077 secs
  Slowest:      0.2309 secs
  Fastest:      0.0091 secs
  Average:      0.0161 secs
  Requests/sec: 124.3840

  Total data:   794642 bytes
  Size/request: 106 bytes

Response time histogram:
  0.009 [1]     |
  0.031 [7119]  |########################################
  0.053 [290]   |##
  0.076 [40]    |
  0.098 [6]     |
  0.120 [1]     |
  0.142 [1]     |
  0.164 [4]     |
  0.187 [0]     |
  0.209 [0]     |
  0.231 [2]     |

Latency distribution:
  10% in 0.0114 secs
  25% in 0.0121 secs
  50% in 0.0134 secs
  75% in 0.0165 secs
  90% in 0.0236 secs
  95% in 0.0306 secs
  99% in 0.0490 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0000 secs, 0.0127 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0005 secs
  resp wait:    0.0160 secs, 0.0090 secs, 0.2308 secs
  resp read:    0.0001 secs, 0.0000 secs, 0.0019 secs

Status code distribution:
  [200] 7464 responses

==> POST /bids  concurrency=5  60s
hey -c 5 -z 60s -m POST \
                -H "X-Customer-ID: as12345" \
                -H "Content-Type: application/json" \
                -d '{"ingress_port":1,"egress_port":0,"units":50,"unit_price":60}' \
                http://146.190.195.42/bids

Summary:
  Total:        60.0274 secs
  Slowest:      0.2543 secs
  Fastest:      0.0146 secs
  Average:      0.0321 secs
  Requests/sec: 155.8121

  Total data:   112236 bytes
  Size/request: 12 bytes

Response time histogram:
  0.015 [1]     |
  0.039 [7593]  |########################################
  0.063 [1527]  |########
  0.086 [187]   |#
  0.110 [32]    |
  0.134 [7]     |
  0.158 [0]     |
  0.182 [0]     |
  0.206 [1]     |
  0.230 [0]     |
  0.254 [5]     |

Latency distribution:
  10% in 0.0223 secs
  25% in 0.0249 secs
  50% in 0.0289 secs
  75% in 0.0356 secs
  90% in 0.0453 secs
  95% in 0.0533 secs
  99% in 0.0745 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0000 secs, 0.0234 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0010 secs
  resp wait:    0.0320 secs, 0.0145 secs, 0.2542 secs
  resp read:    0.0001 secs, 0.0000 secs, 0.0025 secs

Status code distribution:
  [202] 9353 responses


==> GET /flows  concurrency=5  60s
hey -c 5 -z 60s \
                -H "X-Customer-ID: as12345" \
                "http://146.190.195.42/flows?switch_id=sw-1&ingress_port=1&egress_port=0"

Summary:
  Total:        60.0062 secs
  Slowest:      0.5194 secs
  Fastest:      0.0086 secs
  Average:      0.0153 secs
  Requests/sec: 326.6330

  Total data:   2086144 bytes
  Size/request: 106 bytes

Response time histogram:
  0.009 [1]     |
  0.060 [19523] |########################################
  0.111 [54]    |
  0.162 [5]     |
  0.213 [3]     |
  0.264 [9]     |
  0.315 [0]     |
  0.366 [0]     |
  0.417 [0]     |
  0.468 [0]     |
  0.519 [5]     |

Latency distribution:
  10% in 0.0111 secs
  25% in 0.0119 secs
  50% in 0.0131 secs
  75% in 0.0154 secs
  90% in 0.0204 secs
  95% in 0.0272 secs
  99% in 0.0437 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0000 secs, 0.0145 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0018 secs
  resp wait:    0.0152 secs, 0.0085 secs, 0.5193 secs
  resp read:    0.0000 secs, 0.0000 secs, 0.0043 secs

Status code distribution:
  [200] 19600 responses

==> POST /bids  concurrency=10  60s
hey -c 10 -z 60s -m POST \
                -H "X-Customer-ID: as12345" \
                -H "Content-Type: application/json" \
                -d '{"ingress_port":1,"egress_port":0,"units":50,"unit_price":60}' \
                http://146.190.195.42/bids

Summary:
  Total:        60.0444 secs
  Slowest:      0.2785 secs
  Fastest:      0.0161 secs
  Average:      0.0375 secs
  Requests/sec: 266.2698

  Total data:   191856 bytes
  Size/request: 12 bytes

Response time histogram:
  0.016 [1]     |
  0.042 [12040] |########################################
  0.069 [3356]  |###########
  0.095 [409]   |#
  0.121 [132]   |
  0.147 [31]    |
  0.174 [4]     |
  0.200 [6]     |
  0.226 [2]     |
  0.252 [3]     |
  0.279 [4]     |

Latency distribution:
  10% in 0.0248 secs
  25% in 0.0283 secs
  50% in 0.0337 secs
  75% in 0.0422 secs
  90% in 0.0539 secs
  95% in 0.0640 secs
  99% in 0.0972 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0000 secs, 0.0125 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0054 secs
  resp wait:    0.0374 secs, 0.0156 secs, 0.2785 secs
  resp read:    0.0000 secs, 0.0000 secs, 0.0153 secs

Status code distribution:
  [202] 15988 responses


==> GET /flows  concurrency=10  60s
hey -c 10 -z 60s \
                -H "X-Customer-ID: as12345" \
                "http://146.190.195.42/flows?switch_id=sw-1&ingress_port=1&egress_port=0"

Summary:
  Total:        60.0199 secs
  Slowest:      0.2523 secs
  Fastest:      0.0083 secs
  Average:      0.0179 secs
  Requests/sec: 558.2816

  Total data:   3569568 bytes
  Size/request: 106 bytes

Response time histogram:
  0.008 [1]     |
  0.033 [31994] |########################################
  0.057 [1310]  |##
  0.082 [122]   |
  0.106 [29]    |
  0.130 [18]    |
  0.155 [6]     |
  0.179 [11]    |
  0.203 [1]     |
  0.228 [10]    |
  0.252 [6]     |

Latency distribution:
  10% in 0.0119 secs
  25% in 0.0135 secs
  50% in 0.0158 secs
  75% in 0.0192 secs
  90% in 0.0252 secs
  95% in 0.0314 secs
  99% in 0.0490 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0000 secs, 0.0446 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0371 secs
  resp wait:    0.0178 secs, 0.0083 secs, 0.2521 secs
  resp read:    0.0000 secs, 0.0000 secs, 0.0380 secs

Status code distribution:
  [200] 33508 responses


==> POST /bids  concurrency=20  60s
hey -c 20 -z 60s -m POST \
                -H "X-Customer-ID: as12345" \
                -H "Content-Type: application/json" \
                -d '{"ingress_port":1,"egress_port":0,"units":50,"unit_price":60}' \
                http://146.190.195.42/bids

Summary:
  Total:        60.0664 secs
  Slowest:      0.3461 secs
  Fastest:      0.0190 secs
  Average:      0.0540 secs
  Requests/sec: 370.3236

  Total data:   266928 bytes
  Size/request: 12 bytes

Response time histogram:
  0.019 [1]     |
  0.052 [11932] |########################################
  0.084 [8935]  |##############################
  0.117 [1115]  |####
  0.150 [181]   |#
  0.183 [44]    |
  0.215 [27]    |
  0.248 [7]     |
  0.281 [0]     |
  0.313 [0]     |
  0.346 [2]     |

Latency distribution:
  10% in 0.0348 secs
  25% in 0.0410 secs
  50% in 0.0503 secs
  75% in 0.0623 secs
  90% in 0.0767 secs
  95% in 0.0885 secs
  99% in 0.1208 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0000 secs, 0.0094 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0737 secs
  resp wait:    0.0539 secs, 0.0189 secs, 0.3460 secs
  resp read:    0.0001 secs, 0.0000 secs, 0.0038 secs

Status code distribution:
  [202] 22244 responses


==> GET /flows  concurrency=20  60s
hey -c 20 -z 60s \
                -H "X-Customer-ID: as12345" \
                "http://146.190.195.42/flows?switch_id=sw-1&ingress_port=1&egress_port=0"

Summary:
  Total:        60.0212 secs
  Slowest:      0.2441 secs
  Fastest:      0.0087 secs
  Average:      0.0223 secs
  Requests/sec: 898.4494

  Total data:   5673024 bytes
  Size/request: 105 bytes

Response time histogram:
  0.009 [1]     |
  0.032 [48084] |########################################
  0.056 [5169]  |####
  0.079 [497]   |
  0.103 [124]   |
  0.126 [10]    |
  0.150 [3]     |
  0.173 [16]    |
  0.197 [11]    |
  0.221 [3]     |
  0.244 [8]     |

Latency distribution:
  10% in 0.0137 secs
  25% in 0.0162 secs
  50% in 0.0198 secs
  75% in 0.0250 secs
  90% in 0.0330 secs
  95% in 0.0405 secs
  99% in 0.0599 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0000 secs, 0.0112 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0053 secs
  resp wait:    0.0222 secs, 0.0087 secs, 0.2440 secs
  resp read:    0.0000 secs, 0.0000 secs, 0.0095 secs

Status code distribution:
  [200] 53926 responses